"pd.__version__"
"pip install --upgrade numpy --user"

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s1=pd.Series(['veeramani',22,'O+','male'],index=  ["name","age","blood group","sex"])

In [4]:
s2=pd.Series(['haridharan',18,'O+','male'],index=  ["name","age","blood group","sex"])

In [5]:
s3=pd.Series(['arun kumar',18,'O+','male'],index=  ["name","age","blood group","sex"])

In [6]:
s3

name           arun kumar
age                    18
blood group            O+
sex                  male
dtype: object

In [7]:
s1

name           veeramani
age                   22
blood group           O+
sex                 male
dtype: object

In [8]:
s2

name           haridharan
age                    18
blood group            O+
sex                  male
dtype: object

# Data Frame

veriable_Name=pd.DataFrame([data,columns=[column name]])

In [9]:
df1=pd.DataFrame(s1 ,columns=[" details 1"])

In [10]:
df1

             details 1
name         veeramani
age                 22
blood group         O+
sex               male

In [11]:
df1["details 2"]=s2

In [12]:
df1["details 3"]=s3

In [13]:
df1

             details 1   details 2   details 3
name         veeramani  haridharan  arun kumar
age                 22          18          18
blood group         O+          O+          O+
sex               male        male        male

In [14]:
cars={"petrolcars":{1:"Honda Elevate",2:"Honda Amaze",3:"Honda City"},"Electric Cars":{1:"Tata Curvv EV",2:"BYD Seal",3:"Tata Tiago EV"}}

In [15]:
df2=pd.DataFrame(cars,columns=["petrolcars","Electric Cars"])

In [16]:
df2

      petrolcars  Electric Cars
1  Honda Elevate  Tata Curvv EV
2    Honda Amaze       BYD Seal
3     Honda City  Tata Tiago EV

In [29]:
studentform={"name":{1:"veeramani",2:"hari",3:"shiyam",4:"arun",5:"shanmugam"},"reg no":{1:891,2:855,3:830,4:846,5:829},"year":{1:3,2:3,3:3,4:3,5:3}}

In [30]:
df3=pd.DataFrame(studentform,columns=["name","reg no","year"])

In [31]:
df3

        name  reg no  year
1  veeramani     891     3
2       hari     855     3
3     shiyam     830     3
4       arun     846     3
5  shanmugam     829     3

In [39]:
df3.drop(4,axis=0)

        name  reg no  year
1  veeramani     891     3
2       hari     855     3
3     shiyam     830     3
5  shanmugam     829     3

In [40]:
df3.drop("year",axis=1)

        name  reg no
1  veeramani     891
2       hari     855
3     shiyam     830
4       arun     846
5  shanmugam     829